# Лабораторная работа №1: Основы языка C

**Цели работы:**
- изучить синтаксис объявления переменных, задания функций, циклов и условий языка C;
- освоить применение указателей, разобрать вопросы адресации;
- изучить структуры языка C.

**Платформа для выполнения работы**:
- https://repl.it/

## 1. Hello World!

1. Написать программу на языке C с выводом на экран строки "Hello World!", где данная строка является **локальной переменной**.  Объяснить, как в данном случае объявляется переменная. 
2. Написать функцию на C для вычисления суммы двух чисел с плавающей запятой (функцию назвать `sum(...)`).
3. Написать функцию `fib(...)`, которая выводит на экран последовательность чисел Фибоначчи, начинающуюся с `1 1 2 ...`. В качестве аргумента функции должна выступать длина последовательности, которая будет распечатана на экране. Вызовите функцию fib() из функции main().

## 2. Указатели

1. Задать массив целых чисел от 0 до 10. Вывести на экран каждый элемент с помощью цикла. 

2. Дополнить тело функции прототипа: 

```c
#include <stdio.h>
void p_add(int *p_a, int *p_b, int *p_c);

int main(int argc, char *argv[]) 

{   

int a, b, c;   

a = 5;   

b = 4;
       

//p_add(...);   

//printf("Result: %d \n", ...);    

return 0; 

}
```

Функция должна складывать два значения и записывать результат по указателю.


3. Создайте массив символов произвольной длины (больше 4 и меньше 10). Выведите несколько элементов на экран методом адресной арифметики. Размер массива задавайте через `#define`. Номер символа передавать через `argv`.

## 3. Структуры

1. Создатейте структуру films со следующими полями : 

- название
- режиссер
- год
- рейтинг на Кинопоиске

Создать переменную данной структуры и указатель на неё. Поля заполнить через указатель. Распечатать значения полей на экране обращением через переменную. 


2. Создать функцию, которая принимает в качестве аргумента указатель на структуру.

Структура должна содержать 3 указателя на числа с плавающей точкой. Функция должна складывать 2 значения, доступные по данным указателям и записывать результат по третьему. Вывести результат сложения в `main()`.

## Литература

1. Керниган, Б. and Ритчи, Д., 2007. Язык программирования Си= The C programming language.—2-е изд. М.: Вильямс, p.304.
2. Гриффитс, Гриффитс: Изучаем программирование на C, - М. Эксмо, 2013.
3. Клеменс Бен, Язык С в XXI веке / Пep. с англ. А. А. Слинкина. - М.: ДМК Пресс, 2015. - 376 с.: ил.

## Методические материалы

- [Основы языка C: переменные, функции, циклы, условия, структуры, компиляция](https://github.com/kirlf/itpb/blob/master/autumn/1_basics.md)
- [Основы языка C: указатели, работа с памятью](https://github.com/kirlf/itpb/blob/master/autumn/2_pointers.md)
